short_plate_behind_cylinder/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    plate
    {
        type            patch;
        nFaces          84;
        startFace       10441;
    }
    outlet
    {
        type            patch;
        nFaces          43;
        startFace       10525;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       10568;
    }
    cylinder
    {
        type            patch;
        nFaces          61;
        startFace       10608;
    }
    bottom
    {
        type            patch;
        nFaces          117;
        startFace       10669;
    }
    top
    {
        type            patch;
        nFaces          117;
        startFace       10786;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          10672;
        startFace       10903;
    }
)

// ************************************************************************* //
